#### ValueParsingOptions Members

---

|  |
| --- |
| ValueParsingOptions Class   Constructors   Methods   Properties   See Also |

The  ValueParsingOptions  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | ValueParsingOptions | Creates a new ValueParsingOptions object with default settings. |

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  ValueParsingOptions |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetFormatOptions | Gets the FormatOptions to optionally override the default settings in the Units class. |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | SetFormatOptions | Sets the FormatOptions to optionally override the default settings in the Units class. |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | AllowedValues | The allowable range of values to be parsed. |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

ValueParsingOptions Class

Autodesk.Revit.DB Namespace